Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །ཐ་མར་ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་དཔལ་གྱི་སྒྲོལ་མ་ཡོན་ཏན་རྒྱལ་མཚན་མཐོང་བ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འདི་ཐོབ་སྟེ།
en: Finally, through just seeing the Bhagavat Arhat Samyak­saṃbuddha Ratna­śrī­pradīpa­guṇa­ketu, I attained the bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy.

source: དེ་ཐོབ་པས་ཁོ་མོ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་རྣམ་པ་འདི་ལྟ་བུས་སྟ་གོན་དུ་གནས་པ་ཡིན་ནོ།
en: When I had attained it, I took on this kind of form in order to ripen and guide beings.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་རྒྱ་ཆེན་པོའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy.

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འཁོད་ཅིང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པའི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who, at the feet of all the tathāgatas in each instant of mind, attain a great ocean of the power for setting out upon omniscience;

source: འཇུག་པའི་སྒོ་ཐམས་ཅད་ལ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོས་འཇུག་པ། རབ་ཏུ་ཐོབ་པ།
en: who, in each instant of mind, have completed the attainment of an ocean of great prayers within all the entrances for setting out upon omniscience;

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ཕྱི་མའི་མཐའི་བསྐལ་པར་སྤྱད་པའི་དཀྱིལ་འཁོར་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ།
en: who, in each instant of mind, are skilled, through the ways of making an ocean of prayers, in accomplishing a domain of conduct in future kalpas;

source: སྤྱོད་པ་རེ་རེ་ལའང་ལུས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ།
en: who are skilled in accomplishing, within each conduct, as many bodies as there are atoms in all buddha realms;

source: ལུས་རེ་རེས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་ལ་མཁས་པ།
en: who are skilled in pervading, with each body, the entire ocean of different ways in the realm of phenomena;

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་རེ་རེ་ལའང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་རྣམ་པར་དམིགས་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་ལ་མཁས་པ།
en: who are skilled in manifesting, in each ocean of different ways in the realm of phenomena, a perceivable conduct of the body that accords with the dispositions of beings throughout all the buddha realms;

source: ཞིང་ཐམས་ཅད་དུའང་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པར་མཁས་པ།
en: who are skilled in comprehending, in each ocean of different ways in the realm of phenomena, an ocean of tathāgatas, without limit or center, within all the atoms of a realm in all realms;

source: དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་ཡང་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱས་པར་འགེངས་པའི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པར་མཁས་པ།
en: who are skilled in comprehending each tathāgata’s miraculous tathāgata manifestations that pervade the entire extent of the realm of phenomena;

source: དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྔོན་གྱི་མཐའི་བསྐལ་པ་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚོགས་ཡོངས་སུ་བསྒྲུབ་པ་ཡང་དག་པར་བསྡུས་པ་ལ་འཇུག་པར་མཁས་པ།
en: who are skilled in comprehending each tathāgata’s accomplishment of gathering the accumulation of bodhisattva conduct in past kalpas;

source: དེ་བཞིན་གཤེགས་པ་རེ་རེའི་ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་ཡངས་པ། ཡང་དག་པར་བླང་བ་དང་། ཡོངས་སུ་གཟུང་བ་ལ་མཁས་པ།
en: who are skilled in obtaining and possessing each tathāgata’s vast wheel of the Dharma;

source: དུས་གསུམ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་མཁས་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: and who are skilled in comprehending the ocean of the different ways of miraculous manifestations by the tathāgatas in the three times?

source: །སོང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ཉིད་ན་ཁོ་མོ་དང་། རྒྱང་མི་རིང་བ་ཞིག་ན་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this circle of the Tathāgata’s assembly, not far from me, there is the goddess of the night named Samanta­sattva­trāṇojaḥ­śrī.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་འཇུག་པར་བྱ་བ་དང་། ཇི་ལྟར་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བདུན་པ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Pramudita­nayana­jagad­virocanā, circumambulated the night goddess Pramudita­nayana­jagad­virocanā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Pramudita­nayana­jagad­virocanā.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་དེ་ལ་མོས་པར་བྱ་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། རྟོགས་པར་བྱ་བ་དང་། ཤེས་པར་བྱ་བ་དང་། ཡིད་ཆེས་པར་བྱ་བ་དང་། རབ་ཏུ་གཞོལ་བར་བྱ་བ་དང་། རྒྱས་པར་དགང་བར་བྱ་བ་དང་། རྗེས་སུ་ཤེས་པར་བྱ་བ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། རྗེས་སུ་གཞོལ་བར་བྱ་བ་དང་། བསྒོམ་པ་བྱེད་ཅིང་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནན་ཏན་དུ་བྱ་བ་དང་། གདམས་ངག་རྗེས་སུ་བསྟན་པ་ལ་བར་ཆད་མེད་པར་བྱ་བའི་ཕྱིར་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བས།
en: Samanta­sattva­trāṇojaḥ­śrī Then Sudhana, the head merchant’s son, aspiring to the night goddess Pramudita­nayana­jagad­virocanā’s samādhi of the bodhisattva liberation called the banner of the powerof vast, stainless, completely good joy, comprehending it, understanding it, knowing it, believing in it, undertaking it, pervading it, recollecting it, remembering it, and meditating on it, practicing the instruction of the kalyāṇamitra and memorizing the instruction given by the night goddess Pramudita­nayana­jagad­virocanā in order to maintain the continuity of the teaching of instruction, approached the night goddess Samanta­sattva­trāṇojaḥ­śrī.

source: འགྲོ་ཁར་གདམས་པ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བའི་རྗེས་སུ་སེམས་པའི་དབང་པོའི་དཀྱིལ་འཁོར་དང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་སྤྱོད་པ། ཕྱོགས་ཀུན་ཏུ་མངོན་པར་ལྟས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བར་ཡིད་ལ་བྱ་བ་དང་། ང་རྒྱལ་ཐམས་ཅད་དང་བྲལ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་མཐུ་ཚོགས་ཆེན་པོས་ཡོངས་སུ་བསྒྲུབ་པར་ཞེ་ནོན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་། རྒྱུད་ཀྱི་ཚུལ་གཅིག་ཏུ་གྱུར་པའི་དགེ་བའི་རྩ་བས་དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་མཁས་པའི་སྤྱོད་པ་ཐམས་ཅད་ལ་བསམ་པ་མི་ཕྱེད་པས་ཞུགས་པ། །དགེ་བའི་བཤེས་གཉེན་ལ་བརྟན་པ་ཡོངས་སུ་འཕེལ་བར་བྱ་བ་ལ་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཆེན་པོ་རྒྱ་མཚོ་ཡོངས་སུ་སྐྱེས་པ། བསྐལ་པ་ཐམས་ཅད་དུ་དགེ་བའི་བཤེས་གཉེན་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས་གནས་པར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ་དེ།
en: Through contemplating seeing a kalyāṇamitra, through the domain of all his faculties, by going from place to place to obtain the sight of a kalyāṇamitra, through looking in all directions, through being intent on searching for a kalyāṇamitra, through being free from all pride, through the prowess of pleasing a kalyāṇamitra, through being resolved to create a great accumulation of merit, through having become single-mindedly intent upon a kalyāṇamitra, and through all his roots of merit, he had gained the unwavering motivation for a kalyāṇamitra’s conduct of skillful methods, had developed an ocean of the power of diligence for increasing reliance on a kalyāṇamitra, and had prayed to dwell with and follow kalyāṇamitras equally in all kalpas.

source: མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་དྲུང་དུ་སོང་ངོ་། །དེ་དེ་ལྟར་འགྲོ་བའི་ཚེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས་འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར། མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཡོངས་སུ་གྲུབ་པའི་ལུས་བསྟན་ཏེ།
en: As he approached her, the night goddess Samanta­sattva­trāṇojaḥ­śrī, in order to demonstrate the supreme might of the limitless bodhisattva liberation called the manifestations that guide beings that appear in all worlds , revealed her body, which had the complete beautiful signs and features of a great being.

source: མཛོད་སྤུ་ནས་འོད་ཟེར་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་སྣང་བ་དྲི་མ་མེད་པའི་མདངས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་འོད་ཟེར་གྱི་འཁོར་མཐའ་དང་དབུས་མེད་པ་དང་ལྡན་པ་བཀྱེའོ།
en: She then radiated from her ūrṇā hair a ray of light called the banner of stainless light that is a lamp of the complete radiance of wisdom , accompanied by light rays without end or center.

source: །དེས་འཇིག་རྟེན་ཐམས་ཅད་སྣང་བར་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོར་འདུས་ཏེ་ལུས་ཐམས་ཅད་དུ་ཁྱབ་པར་གྱུར་ཏོ།
en: They illuminated all worlds and then descended into the crown of the head of Sudhana, the head merchant’s son, and spread throughout his entire body.

source: །ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འོད་ཟེར་དེས་རེག་པར་གྱུར་མ་ཐག་ཏུ་དེ་ཉིད་ཀྱི་མོད་ལ་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བའི་དཀྱིལ་འཁོར་ཐོབ་པར་གྱུར་ཏོ།
en: As soon as Sudhana, the head merchant’s son, was touched by those light rays, he instantly attained the samādhi called the area that is completely free of particles

source: །དེ་ཐོབ་པས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་དང་། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ནས་སྐྱོང་བའི་གཟི་བརྗིད་ཀྱི་དཔལ་གཉིས་ཀྱི་བར་གྱི་ལམ་ན་སའི་དཀྱིལ་འཁོར་ཡོད་པ་དེ་ལ་མེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: Because he had attained that, he saw the area of ground that was the route between the night goddess Pramudita­nayana­jagad­virocanā and the night goddess Samanta­sattva­trāṇojaḥ­śrī as being made of atoms of fire;

source: ཆུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: or atoms of water;

source: སའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: or atoms of earth;

source: རྡོ་རྗེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: or atoms of diamond;

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དམ་པ་སྣ་ཚོགས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: or atoms of various great kings of precious jewels;

source: མེ་ཏོག་དང་། སྤོས་དང་། ཕྱེ་མའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ་རྒྱན་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའམ།
en: or atoms of flowers, incense, and powders; or atoms of all precious arrays;

source: དམིགས་པ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཅིག་ཡོད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དེ་དག་ཐམས་ཅད་ལ་རྡུལ་ཕྲ་མོ་རེ་རེ་ཞིང་ཡང་།
en: or atoms of all locations.

source: འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད། ཆུའི་ཕུང་པོ་དང་བཅས། མེའི་ཕུང་པོ་དང་བཅས། རླུང་གི་ཕུང་པོ་དང་བཅས། སའི་ཕུང་པོ་དང་བཅས། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མཚམས་དང་བཅས། གཞི་དང་བཅས་རྟེན་དང་བཅས་པ་དབྱིབས་སྣ་ཚོགས་ཅན་སའི་གཞི་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དང་ལྡན་པའི་རིའི་འཁོར་སྣ་ཚོགས་ཅན། ཆུ་རླུང་དང་མཚོ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་རྒྱ་མཚོ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་འཁོར་བ། ལྷ་རྫས་ཀྱི་ཁྱིམ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ། ཤིང་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ། ནམ་མཁའི་དབྱིངས་ཀྱི་རྒྱན་སྣ་ཚོགས་ཅན། ལྷའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ཀླུའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། གནོད་སྦྱིན་གྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། དྲི་ཟའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ལྷ་མ་ཡིན་གྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ནམ་མཁའ་ལྡིང་གི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ།
en: In each atom there were world realms as numerous as the atoms in a buddha realm.

source: མིའམ་ཅིའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ལྟོ་འཕྱེ་ཆེན་པོའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། མིའི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་རྒྱན་དང་བཅས་པ། ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་ན་རྣམ་པར་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲོང་ཁྱེར་གྱི་ཁྱིམ་གྱི་གནས་དང་། སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ཡུལ་དང་། མི་དང་མི་མ་ཡིན་པའི་ལམ་གྱི་རྒྱུད་ཀྱི་ཤི་འཕོ་དང་། སྐྱེ་བའི་ཡུལ་དང་བཅས་པ། སྐྱེ་བ་སྣ་ཚོགས་ཀྱིས་མ་འདྲེས་པའི་རྒྱུད་མཐའ་ཡས་པའི་བྱེ་བྲག་ལ་ཡོངས་སུ་གཞོལ་བ་རྣམས་འདུ་ཞིང་འཇིག་པར་གྱུར་པ་མཐོང་ངོ་།
en: He saw that they had aggregations of water, had aggregations of fire, had aggregations of air, had aggregations of earth, had world-realm boundaries, had bases, had foundations, had different shapes, had surfaces of various kinds of different forms, had different kinds of encircling mountains, had various kinds of encircling oceans, had arrays of various kinds of buildings made of divine materials, had various kinds of trees, had various adornments in the sky, had the adornment of the buildings of the cities of devas, had the adornment of the buildings of the cities of nāgas, had the adornment of the buildings of the cities of yakṣas, had the adornment of the buildings of the cities of gandharvas, had the adornment of the buildings of the cities of the asuras, had the adornment of the buildings of the cities of garuḍas, had the adornment of the buildings of the cities of kinnaras, had the adornment of the buildings of the cities of mahoragas, had the adornment of the buildings of the cities of humans, had the adornment of the buildings of the cities of all beings in the main and intermediate directions, had the realm of the world of hells, had the realm of the world of animals, had the realm of the world of Yama, had the realm of the death and rebirth of humans and nonhumans, had various kinds of births, and had the accumulation and destruction of various kinds of existences.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཀྱང་རྣམ་པ་སྣ་ཚོགས་སུ་མཐོང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ལམ་གྱི་རྒྱུད་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ལ་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་རྣམ་པར་དག་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པར་མཐོང་ངོ་།
en: He saw various kinds of differences between those worlds:

source: །ལ་ལ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་མཐོང་ངོ་། །ལ་ལ་ནི་གཞི་མཉམ་པར་མཐོང་ངོ་། །ལ་ལ་ནི་སྤྱིའུ་ཚུགས་སུ་གནས་པར་མཐོང་ངོ་། །ལ་ལ་ནི་སྣྲེལ་ཞིར་འདུག་པར་མཐོང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་དང་། སེམས་ཅན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་ན་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་སེམས་ཅན་སོ་སོ་ནས་འདུལ་བའི་རྐྱེན་བཞིན་དུ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མ་འདྲེས་པར་ཡོངས་སུ་བསྟན་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པར་གནས་པར་མཐོང་ངོ་།
en: he saw some worlds that were defiled, some that were pure, some that were completely defiled, some that were purified of ordinary existences, some that were purified of defilements, some that were both pure and defiled, some that were completely pure, some that were a flat surface, some that were upside-down, and some that were disordered, and he saw how in all the existences of beings, in all the births of beings in those world realms, the night goddess Samanta­sattva­trāṇojaḥ­śrī became present for all those beings in order to guide them according to their circumstances.

source: །སེམས་ཅན་ཚེའི་ཚད་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། མོས་པའི་སྤྱོད་ཡུལ་རྣམ་པ་སྣ་ཚོགས་ཅན་དང་། ལུས་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། ངག་རྣམ་པར་ཕྱེ་བ་དང་། ངེས་པའི་ཚིག་གི་འདུ་བྱེད་ཀྱི་ཐ་སྙད་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། སྦྱོར་བའི་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། དབང་གི་རྣམ་པ་ཇི་ལྟ་བུ་དང་ལྡན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་གདུལ་བའི་དོན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མ་འདྲེས་པར་མངོན་སུམ་དུ་གནས་པར་མཐོང་ངོ་།
en: He saw her becoming present separately for every being in order to ripen and guide them in accordance with their lifespans; the various scopes of their aspirations; the forms of their bodies; their languages, terminology, and established definitions; the forms of their practices;

source: །དེ་ཡང་འདི་ལྟ་སྟེ།
en: and their dominance. This means that he saw her becoming present separately for every being in order to dispel the fear of the various sufferings of hell for the beings who were in hell existences;

source: སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་དང་། འཇིག་པ་རྣམ་པར་བཟློག་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སྣ་ཚོགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་གཅིག་ལ་གཅིག་ཟ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བཀྲེས་པ་དང་། སྐོམ་པ་ལ་སྩོགས་པའི་སྡུག་བསྔལ་གྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ཀླུའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཀླུའི་སྡུག་བསྔལ་དང་། འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་པའི་ཁམས་ཀྱི་སྡུག་བསྔལ་དང་། འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། མིའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མཚན་མོའི་མུན་པ་མུན་ནག་གིས།
en: in order to dispel in beings among the various animals the fear of being eaten by one another; in order to dispel the fear of the suffering of hunger, thirst, and so on for beings within Yama’s realm; in order to dispel all fear of the suffering of nāgas for those in nāga existences; in order to dispel all fear of the sufferings of the desire realm for all beings within the desire realms; in order to dispel in those who existed in the human world all fear of being bewildered in the darkness of night;

source: ཆོད་པའི་མུན་པའི་འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། མི་སྙན་པ་དང་། བསྔགས་པའི་མ་ཡིན་པ་དང་། གྲགས་པ་མ་ཡིན་པའི་སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་ལ་མངོན་པར་ཞེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་གྲགས་པ་མ་ཡིན་པ་དང་། བསྔགས་པ་མ་ཡིན་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཁོར་གྱི་འཇིགས་པར་ལྷུང་བའི་སེམས་ཅན་རྣམས་ཀྱི་འཁོར་ཏུ་བག་ཚ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཆི་བས་འཇིགས་ཤིང་སྡང་བའི་སེམས་ཅན་རྣམས་ཀྱི་འཆི་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ངན་སོང་གི་གཡང་སས་འཇིགས་ཤིང་སྔང་བའི་སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཚོ་བ་མེད་པས་འཇིགས་ཤིང་སྐྲག་པའི་སེམས་ཅན་རྣམས་ཀྱི་འཚོ་བ་མེད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དགེ་བའི་རྩ་བ་ཆུད་ཟོས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཆུད་ཟོས་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཉམས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་ཉམས་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སྡིག་ཏོའི་གྲོགས་པོ་དང་ཕྲད་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་སྡིག་ཏོའི་གྲོགས་པོ་དང་ཕྲད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་གྱིས་དོགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་གིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཁོར་བའི་གནས་སྣ་ཚོགས་ཀྱི་སྡུག་བསྔལ་གྱིས་འཇིགས་ཤིང་སྐྲག་པ་རྣམས་ཀྱི་འཁོར་བའི་གནས་སྣ་ཚོགས་ཀྱི་སྡུག་བསྔལ་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་སྐལ་བ་མི་མཉམ་པ་དང་ཕྲད་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་སེམས་ཅན་སྐལ་བ་མི་མཉམ་པ་དང་ཕྲད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དུས་མི་བཟང་བར་སྐྱེས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་དུས་མི་བཟད་པར་སྐྱེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། རིགས་ངན་པར་སྐྱེས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་རིགས་ངན་པར་སྐྱེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སྡིག་ཏོའི་ལས་བྱས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི།
en: in order to dispel the fear of blame and infamy for those who were preoccupied with criticism, blame, and infamy; in order to dispel the fear of anxiety before an assembly for those beings who had the fear of anxiety before an assembly; in order to dispel the fear of death in those beings who were frightened and terrified of death; in order to dispel the fear of the abyss of the lower existences for those beings who were frightened and terrified of the abyss of the lower realms; in order to dispel the fear of having no livelihood for those beings who were frightened and terrified of having no livelihood; in order to dispel the fear of the loss of their roots of merit for those beings who were frightened of losing their roots of merit; in order to dispel the fear of a diminution of the aspiration for enlightenment for those beings who were afraid of a diminution of their aspiration for enlightenment; in order to dispel the fear of meeting bad companions for those beings who were frightened of meeting bad companions; in order to dispel the fear of separation from kalyāṇamitras in those beings who were frightened of separation from kalyāṇamitras; in order to dispel the fear of falling to the level of śrāvakas and pratyeka­buddhas in those beings who were frightened of falling to the level of śrāvakas and pratyeka­buddhas; in order to dispel the fear of the various kinds of suffering in saṃsāra for those beings who were afraid of the various kinds of suffering in saṃsāra; in order to dispel the fear of meeting contrary beings for those beings who were frightened and afraid of meeting contrary beings; in order to dispel the fear of unfortunate times in those beings who were frightened and afraid of unfortunate times; in order to dispel the fear of rebirth into unfortunate families in those beings who were frightened and afraid of rebirth into unfortunate families;

source: སྡིག་ཏོའི་ལས་བྱེད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པས་འཇིགས་ཤིང་སྔང་བ་རྣམས་ཀྱི་ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གནས་དང་འཆིང་བས་འཇིགས་ཤིང་སྔང་བ་རྣམས་ཀྱི་འདུ་ཤེས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གནས་དང་། འཆིང་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་སོ་སོར་མངོན་ཏུ་གྱུར་པར་གནས་པ་མཐོང་ངོ་།
en: in order to dispel the fear of committing bad actions for those beings who were frightened and afraid of committing bad actions; in order to dispel the fear of the obscurations of karma and kleśas for those beings who were frightened and afraid of the obscurations of karma and kleśas; and in order to dispel the fear of the bondage of remaining fixed in a variety of conceptions for those beings who were frightened and afraid of remaining fixed in a variety of conceptions. This means he saw her, being present in and purifying all realms, through possessing the supremacy of the vast miraculous powers of bodhisattva liberation and through the accomplishment of the power of the prayer to protect all beings:

source: །འདི་ལྟ་སྟེ་སྒོ་ང་ལས་སྐྱེས་པའི་སེམས་ཅན་དང་། མངལ་ནས་སྐྱེས་པ་དང་། དྲོད་གཤེར་ལས་སྐྱེས་པ་དང་། རྫུས་ཏེ་སྐྱེས་པ་དང་། གཟུགས་ཡོད་པ་དང་། གཟུགས་མེད་པ་དང་། འདུ་ཤེས་ཡོད་པ་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་ཤེས་ཡོད་པའང་མ་ཡིན།
en: beings born from eggs, born from wombs, born from warm moisture, born spontaneously, and with form, without form, with perception, without perception, and neither with perception nor without perception; through the vast prowess of the power of bodhisattva samādhi; through the power of the great higher cognitions of a bodhisattva;

source: འདུ་ཤེས་མེད་པ་ཡང་མ་ཡིན་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སྨོན་ལམ་གྱི་སྟོབས་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཤུགས་དྲག་པོ་དང་། རྣམ་པར་གནོན་པ་ཤིན་ཏུ་ཡངས་པའི་སྟོབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཆེན་པོའི་སྟོབས་དང་། མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོའི་ཤུགས་དྲག་པོ་ཤིན་ཏུ་སྐྱེས་པའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པའི་བྱམས་པ་ཆེན་པོས་རྒྱས་པར་དགང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཡེ་ཤེས་རབ་ཏུ་བསྒྲུབ་པའི་ཕྱིར།
en: through the power of attaining the completely good conduct and prayer of a bodhisattva; and through developing the power of an ocean of the ways of compassion; in order to spread everywhere the great love for all beings that is free of attachment; in order to create happiness for all beings and increase the power of their joy; and so that all beings will accomplish the accumulation of wisdom. He saw her focused on knowing the knowledge of all Dharmas;

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་ལྡན་པས་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པར་གནས་པར་མཐོང་ངོ་།
en: being present there focused on making offerings and honoring all buddhas;
